1. Constructor(default - no args and overloaded)
   overloading -> same name, but various args



   Encapsulation(private, public, package-private)

   Inheritance -> is-a -> super -> overriding

   Abstraction -> Parent p = new Child(); -> instanceof operator

   Polymorphism -> overriding


   Debug mode in Intellij
       Breakpoints
       Step Over, Step In, Step Out, Resume

   Class and Relations(has-a and is-a)

   Formatter -> String.format, System.out.printf
    class Date

    super class Object
    methods: toString and equals
    difference between 'equals' and '=='

    If you want share your homework via git -> https://www.youtube.com/watch?v=R6JomxUjTq8&feature=youtu.be

2. Предметная область - Библиотека
   Основные классы: Библиотека, Книга, Читатель

   Написать программу позволяющую узнать следующую информацию:
     1) посмотреть список читателей
     2) посмотреть список доступных книг
     3) добавить книгу в библиотеку
     4) добавить читателя в список читателей
     5) выдать книгу читателю (если книга есть в наличии).
        Читателю запрещается брать больше 3-х книг.
     6) посмотреть список книг, которые находятся у читателей
     7) посмотреть список книг, которые находятся у конкретного читателя
     8) добавить читателя в черный список (ему нельзя выдавать книги)
     9) посмотреть книги конкретного автора
     10) посмотреть новые книги (год издания выше 2013)


3. Write your own ArrayList!
 First look the structure and methods of Java ArrayList!!!

 implement different constructors

 implement methods:

 * add(index)
 * add(index, Object)
 * get(index)
 * remove(index)
 * remove(index, Object)
 * set(index, Object)
 * clear()
 * contains(Object)
 * size()